src/load-tests/reports/summary_user_load_testing1.txt
config:
  target: "http://localhost:3000"  
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create and fetch users"
    flow:
      - post:
          url: "/users"
          json:
            username: "test_{{ $randomString(8) }}"
            email: "test_{{ $randomString(8) }}@g.ucla.edu"
            password: "Password123!"

      - get:
          url: "/users"

-----------------------------------------------------------------------------------------------------------------------

All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 19:33:00(-0800)
--------------------------------

http.codes.200: ................................................................ 300
http.codes.201: ................................................................ 300
http.downloaded_bytes: ......................................................... 528777120
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 275
  max: ......................................................................... 1587
  mean: ........................................................................ 494.5
  median: ...................................................................... 459.5
  p95: ......................................................................... 772.9
  p99: ......................................................................... 963.1
http.response_time.2xx:
  min: ......................................................................... 275
  max: ......................................................................... 1587
  mean: ........................................................................ 494.5
  median: ...................................................................... 459.5
  p95: ......................................................................... 772.9
  p99: ......................................................................... 963.1
http.responses: ................................................................ 600
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Create and fetch users: ................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 628.4
  max: ......................................................................... 2092.8
  mean: ........................................................................ 1005.8
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1720.2