src/load-tests/reports/summary_user_load_testing2.txt

All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 19:39:11(-0800)
--------------------------------

http.codes.200: ................................................................ 300
http.codes.201: ................................................................ 300
http.downloaded_bytes: ......................................................... 551586888
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 277
  max: ......................................................................... 4307
  mean: ........................................................................ 555.9
  median: ...................................................................... 487.9
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1863.5
http.response_time.2xx:
  min: ......................................................................... 277
  max: ......................................................................... 4307
  mean: ........................................................................ 555.9
  median: ...................................................................... 487.9
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1863.5
http.responses: ................................................................ 600
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Create and fetch users: ................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 687.7
  max: ......................................................................... 4707.6
  mean: ........................................................................ 1128.9
  median: ...................................................................... 1064.4
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 2276.1