src/load-tests/reports/summary_user_load_testing3.txt

All VUs finished. Total time: 1 minute, 0 seconds

--------------------------------
Summary report @ 20:28:01(-0800)
--------------------------------

http.codes.201: ................................................................ 300
http.downloaded_bytes: ......................................................... 19200
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 266
  max: ......................................................................... 618
  mean: ........................................................................ 294.5
  median: ...................................................................... 284.3
  p95: ......................................................................... 340.4
  p99: ......................................................................... 528.6
http.response_time.2xx:
  min: ......................................................................... 266
  max: ......................................................................... 618
  mean: ........................................................................ 294.5
  median: ...................................................................... 284.3
  p95: ......................................................................... 340.4
  p99: ......................................................................... 528.6
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Create and fetch users: ................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 267.8
  max: ......................................................................... 623.4
  mean: ........................................................................ 297.1
  median: ...................................................................... 284.3
  p95: ......................................................................... 340.4
  p99: ......................................................................... 528.6