src/load-tests/reports/summary_user_load_testing4.txt
config:
  target: "http://localhost:3000"  
  phases:
    - duration: 60
      arrivalRate: 5
  defaults:
    headers:
      Content-Type: "application/json"
      
scenarios:
  - name: "Create and fetch users"
    flow:
      - post:
          url: "/users"
          json:
            username: "test_{{ $randomString(8) }}"
            email: "test_{{ $randomString(8) }}@g.ucla.edu"
            password: "Password123!"

      - get:
          url: "/users"

      - delete:
          url: "/users/cleanup/test-users"

-----------------------------------------------------------------------------------------------------------------------

All VUs finished. Total time: 1 minute, 0 seconds

--------------------------------
Summary report @ 20:30:07(-0800)
--------------------------------

http.codes.200: ................................................................ 600
http.codes.201: ................................................................ 300
http.downloaded_bytes: ......................................................... 442333358
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 30
  max: ......................................................................... 3196
  mean: ........................................................................ 347.9
  median: ...................................................................... 284.3
  p95: ......................................................................... 944
  p99: ......................................................................... 2018.7
http.response_time.2xx:
  min: ......................................................................... 30
  max: ......................................................................... 3196
  mean: ........................................................................ 347.9
  median: ...................................................................... 284.3
  p95: ......................................................................... 944
  p99: ......................................................................... 2018.7
http.responses: ................................................................ 900
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Create and fetch users: ................................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 532.1
  max: ......................................................................... 4279.4
  mean: ........................................................................ 1058.9
  median: ...................................................................... 889.1
  p95: ......................................................................... 1939.5
  p99: ......................................................................... 3678.4
Log file: src/load-tests/reports/user_load_testing4.json