src/load-tests/reports/summary_user_load_testing5.txt
config:
  target: "http://localhost:3000"  
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: "application/json"
      
scenarios:
  - name: "Create and fetch users"
    flow:
      - post:
          url: "/users"
          json:
            username: "test_{{ $randomString(8) }}"
            email: "test_{{ $randomString(8) }}@g.ucla.edu"
            password: "Password123!"

-----------------------------------------------------------------------------------------------------------------------


All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 20:47:55(-0800)
--------------------------------

http.codes.201: ................................................................ 600
http.downloaded_bytes: ......................................................... 38400
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 267
  max: ......................................................................... 568
  mean: ........................................................................ 311.8
  median: ...................................................................... 308
  p95: ......................................................................... 383.8
  p99: ......................................................................... 487.9
http.response_time.2xx:
  min: ......................................................................... 267
  max: ......................................................................... 568
  mean: ........................................................................ 311.8
  median: ...................................................................... 308
  p95: ......................................................................... 383.8
  p99: ......................................................................... 487.9
http.responses: ................................................................ 600
vusers.completed: .............................................................. 600
vusers.created: ................................................................ 600
vusers.created_by_name.Create and fetch users: ................................. 600
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 269.2
  max: ......................................................................... 570
  mean: ........................................................................ 313.9
  median: ...................................................................... 308
  p95: ......................................................................... 383.8
  p99: ......................................................................... 507.8
Log file: src/load-tests/reports/user_load_testing5.json